stevenj/avr-libc3/include/avr/io/attiny48.h
/* CPU - CPU Registers (0x0000) */
#define CPU_BASE        _SFR_MEM8 (0x0000) /* CPU Base Address */
#define CPU_PORTCR      _SFR_MEM8 (0x0032) /* Port Configuration Register */
#define CPU_GPIOR0      _SFR_MEM8 (0x003E) /* General Purpose I/O Register 0 */
#define CPU_GPIOR1      _SFR_MEM8 (0x004A) /* General Purpose I/O Register 1 */
#define CPU_GPIOR2      _SFR_MEM8 (0x004B) /* General Purpose I/O Register 2 */
#define CPU_SMCR        _SFR_MEM8 (0x0053) /* Sleep Mode Control Register */
#define CPU_MCUSR       _SFR_MEM8 (0x0054) /* MCU Status Register */
#define CPU_MCUCR       _SFR_MEM8 (0x0055) /* MCU Control Register */
#define CPU_SPMCSR      _SFR_MEM8 (0x0057) /* Store Program Memory Control Register */
#define CPU_SPL         _SFR_MEM8 (0x005D) /* Stack Pointer Low */
#define CPU_SPH         _SFR_MEM8 (0x005E) /* Stack Pointer High */
#define CPU_SREG        _SFR_MEM8 (0x005F) /* Status Register */
#define CPU_CLKPR       _SFR_MEM8 (0x0061) /* Clock Prescale Register */
#define CPU_PRR         _SFR_MEM8 (0x0064) /* Power Reduction Register */
#define CPU_OSCCAL      _SFR_MEM8 (0x0066) /* Oscillator Calibration Value */

/* TWI - Two Wire Serial Interface (0x0000) */
#define TWI_BASE        _SFR_MEM8 (0x0000) /* TWI Base Address */
#define TWI_TWBR        _SFR_MEM8 (0x00B8) /* TWI Bit Rate register */
#define TWI_TWSR        _SFR_MEM8 (0x00B9) /* TWI Status Register */
#define TWI_TWAR        _SFR_MEM8 (0x00BA) /* TWI (Slave) Address register */
#define TWI_TWDR        _SFR_MEM8 (0x00BB) /* TWI Data register */
#define TWI_TWCR        _SFR_MEM8 (0x00BC) /* TWI Control Register */
#define TWI_TWAMR       _SFR_MEM8 (0x00BD) /* TWI (Slave) Address Mask Register */
#define TWI_TWHSR       _SFR_MEM8 (0x00BE) /* TWHSR */

/* ADC - Analog-to-Digital Converter (0x0000) */
#define ADC_BASE        _SFR_MEM16(0x0000) /* ADC Base Address */
#define ADC_ADC         _SFR_MEM16(0x0078) /* ADC Data Register  Bytes */
#define ADC_ADCL        _SFR_MEM8 (0x0078) /* ADC Data Register  Bytes LOW BYTE */
#define ADC_ADCH        _SFR_MEM8 (0x0079) /* ADC Data Register  Bytes HIGH BYTE */
#define ADC_ADCSRA      _SFR_MEM8 (0x007A) /* The ADC Control and Status register A */
#define ADC_ADCSRB      _SFR_MEM8 (0x007B) /* The ADC Control and Status register B */
#define ADC_ADMUX       _SFR_MEM8 (0x007C) /* The ADC multiplexer Selection Register */
#define ADC_DIDR0       _SFR_MEM8 (0x007E) /* Digital Input Disable Register 0 */
#define ADC_DIDR1       _SFR_MEM8 (0x007F) /* Digital Input Disable Register 1 */

/* EXINT - External Interrupts (0x0000) */
#define EXINT_BASE      _SFR_MEM8 (0x0000) /* EXINT Base Address */
#define EXINT_PCIFR     _SFR_MEM8 (0x003B) /* Pin Change Interrupt Flag Register */
#define EXINT_EIFR      _SFR_MEM8 (0x003C) /* External Interrupt Flag Register */
#define EXINT_EIMSK     _SFR_MEM8 (0x003D) /* External Interrupt Mask Register */
#define EXINT_PCICR     _SFR_MEM8 (0x0068) 
#define EXINT_EICRA     _SFR_MEM8 (0x0069) /* External Interrupt Control Register */
#define EXINT_PCMSK3    _SFR_MEM8 (0x006A) /* Pin Change Mask Register 3 */
#define EXINT_PCMSK0    _SFR_MEM8 (0x006B) /* Pin Change Mask Register 0 */
#define EXINT_PCMSK1    _SFR_MEM8 (0x006C) /* Pin Change Mask Register 1 */
#define EXINT_PCMSK2    _SFR_MEM8 (0x006D) /* Pin Change Mask Register 2 */

/* TC0 - Timer/Counter, 8-bit (0x0000) */
#define TC8_BASE        _SFR_MEM8 (0x0000) /* TC8 Base Address */
#define TC8_TIFR0       _SFR_MEM8 (0x0035) /* Timer/Counter0 Interrupt Flag register */
#define TC8_GTCCR       _SFR_MEM8 (0x0043) /* General Timer/Counter Control Register */
#define TC8_TCCR0A      _SFR_MEM8 (0x0045) /* Timer/Counter  Control Register A */
#define TC8_TCNT0       _SFR_MEM8 (0x0046) /* Timer/Counter0 */
#define TC8_OCR0A       _SFR_MEM8 (0x0047) /* Timer/Counter0 Output Compare Register */
#define TC8_OCR0B       _SFR_MEM8 (0x0048) /* Timer/Counter0 Output Compare Register */
#define TC8_TIMSK0      _SFR_MEM8 (0x006E) /* Timer/Counter0 Interrupt Mask Register */

/* EEPROM - EEPROM (0x0000) */
#define EEPROM_BASE     _SFR_MEM8 (0x0000) /* EEPROM Base Address */
#define EEPROM_EECR     _SFR_MEM8 (0x003F) /* EEPROM Control Register */
#define EEPROM_EEDR     _SFR_MEM8 (0x0040) /* EEPROM Data Register */
#define EEPROM_EEARL    _SFR_MEM8 (0x0041) /* EEPROM Address Register Low Byte */

/* FUSE - Fuses (0x0000) */
#define FUSE_BASE       _SFR_MEM8 (0x0000) /* FUSE Base Address */
#define FUSE_LOW        _SFR_MEM8 (0x0000) 
#define FUSE_HIGH       _SFR_MEM8 (0x0001) 
#define FUSE_EXTENDED   _SFR_MEM8 (0x0002) 

/* LOCKBIT - Lockbits (0x0000) */
#define LOCKBIT_BASE    _SFR_MEM8 (0x0000) /* LOCKBIT Base Address */
#define LOCKBIT_LOCKBIT _SFR_MEM8 (0x0000) 
/* avr-libc typedef for avr/fuse.h */
typedef FUSE_t NVM_FUSES_t;

/*
================================================================================
Interrupt Vector Definitions
================================================================================
*/

/* Vector 0 is the reset vector */
#define None_RESET_vect_num        (0)                 
#define None_RESET_vect            _VECTOR(0)          /* External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset */
#define None_INT0_vect_num         (1)                 
#define None_INT0_vect             _VECTOR(1)          /* External Interrupt Request 0 */
#define None_INT1_vect_num         (2)                 
#define None_INT1_vect             _VECTOR(2)          /* External Interrupt Request 1 */
#define None_PCINT0_vect_num       (3)                 
#define None_PCINT0_vect           _VECTOR(3)          /* Pin Change Interrupt Request 0 */
#define None_PCINT1_vect_num       (4)                 
#define None_PCINT1_vect           _VECTOR(4)          /* Pin Change Interrupt Request 1 */
#define None_PCINT2_vect_num       (5)                 
#define None_PCINT2_vect           _VECTOR(5)          /* Pin Change Interrupt Request 2 */
#define None_PCINT3_vect_num       (6)                 
#define None_PCINT3_vect           _VECTOR(6)          /* Pin Change Interrupt Request 3 */
#define None_WDT_vect_num          (7)                 
#define None_WDT_vect              _VECTOR(7)          /* Watchdog Time-out Interrupt */
#define None_TIMER1_CAPT_vect_num  (8)                 
#define None_TIMER1_CAPT_vect      _VECTOR(8)          /* Timer/Counter1 Capture Event */
#define None_TIMER1_COMPA_vect_num (9)                 
#define None_TIMER1_COMPA_vect     _VECTOR(9)          /* Timer/Counter1 Compare Match A */
#define None_TIMER1_COMPB_vect_num (10)                
#define None_TIMER1_COMPB_vect     _VECTOR(10)         /* Timer/Counter1 Compare Match B */
#define None_TIMER1_OVF_vect_num   (11)                
#define None_TIMER1_OVF_vect       _VECTOR(11)         /* Timer/Counter1 Overflow */
#define None_TIMER0_COMPA_vect_num (12)                
#define None_TIMER0_COMPA_vect     _VECTOR(12)         /* TimerCounter0 Compare Match A */
#define None_TIMER0_COMPB_vect_num (13)                
#define None_TIMER0_COMPB_vect     _VECTOR(13)         /* TimerCounter0 Compare Match B */
#define None_TIMER0_OVF_vect_num   (14)                
#define None_TIMER0_OVF_vect       _VECTOR(14)         /* Timer/Couner0 Overflow */
#define None_SPI_STC_vect_num      (15)                
#define None_SPI_STC_vect          _VECTOR(15)         /* SPI Serial Transfer Complete */
#define None_ADC_vect_num          (16)                
#define None_ADC_vect              _VECTOR(16)         /* ADC Conversion Complete */
#define None_EE_RDY_vect_num       (17)                
#define None_EE_RDY_vect           _VECTOR(17)         /* EEPROM Ready */
#define None_ANALOG_COMP_vect_num  (18)                
#define None_ANALOG_COMP_vect      _VECTOR(18)         /* Analog Comparator */
#define None_TWI_vect_num          (19)                
#define None_TWI_vect              _VECTOR(19)         /* Two-wire Serial Interface */

/* Vector Table Size */
#define _VECTOR_SIZE               (2)                 /* Size of individual vector. */
#define _VECTORS_SIZE              (20 * _VECTOR_SIZE) /* Size of all vectors */
/*
================================================================================
Constants
================================================================================
*/

#define PROGMEM_START   (0x0000)                           
#define PROGMEM_SIZE    (0x1000)                           
#define PROGMEM_END     (PROGMEM_START + PROGMEM_SIZE - 1) 

